###############################################################################
# Created by write_sdc
###############################################################################
current_design MIPSpipeline
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_pc[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {current_pc[31]}]
set_load -pin_load 0.0334 [get_ports {current_pc[30]}]
set_load -pin_load 0.0334 [get_ports {current_pc[29]}]
set_load -pin_load 0.0334 [get_ports {current_pc[28]}]
set_load -pin_load 0.0334 [get_ports {current_pc[27]}]
set_load -pin_load 0.0334 [get_ports {current_pc[26]}]
set_load -pin_load 0.0334 [get_ports {current_pc[25]}]
set_load -pin_load 0.0334 [get_ports {current_pc[24]}]
set_load -pin_load 0.0334 [get_ports {current_pc[23]}]
set_load -pin_load 0.0334 [get_ports {current_pc[22]}]
set_load -pin_load 0.0334 [get_ports {current_pc[21]}]
set_load -pin_load 0.0334 [get_ports {current_pc[20]}]
set_load -pin_load 0.0334 [get_ports {current_pc[19]}]
set_load -pin_load 0.0334 [get_ports {current_pc[18]}]
set_load -pin_load 0.0334 [get_ports {current_pc[17]}]
set_load -pin_load 0.0334 [get_ports {current_pc[16]}]
set_load -pin_load 0.0334 [get_ports {current_pc[15]}]
set_load -pin_load 0.0334 [get_ports {current_pc[14]}]
set_load -pin_load 0.0334 [get_ports {current_pc[13]}]
set_load -pin_load 0.0334 [get_ports {current_pc[12]}]
set_load -pin_load 0.0334 [get_ports {current_pc[11]}]
set_load -pin_load 0.0334 [get_ports {current_pc[10]}]
set_load -pin_load 0.0334 [get_ports {current_pc[9]}]
set_load -pin_load 0.0334 [get_ports {current_pc[8]}]
set_load -pin_load 0.0334 [get_ports {current_pc[7]}]
set_load -pin_load 0.0334 [get_ports {current_pc[6]}]
set_load -pin_load 0.0334 [get_ports {current_pc[5]}]
set_load -pin_load 0.0334 [get_ports {current_pc[4]}]
set_load -pin_load 0.0334 [get_ports {current_pc[3]}]
set_load -pin_load 0.0334 [get_ports {current_pc[2]}]
set_load -pin_load 0.0334 [get_ports {current_pc[1]}]
set_load -pin_load 0.0334 [get_ports {current_pc[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
